{
  "posts": [
    {
      "id": 1,
      "title": "hello"
    }
  ],
  "profile": {
    "name": "typicode"
  },
  "array": [
   {
      "id": 1,
      "title": "Conor Java 29 2021",
      "categoria": "MTB",
      "descriptionPrimary": "Bicicleta de aluminio Conor Java 29, de asistencia eléctrica al pedaleo con batería de 504 Wh.",
      "descriptionSecondary":"Con un montaje de: Cuadro 29 Aluminio 6061, tuberia hidroformada Horquilla Suntour XCM RL con bloqueo, recorrido 100mm, Manetas Shimano Acera M3000 9v, Frenos Shimano disco hidraúlicos MT-200, Cambio Shimano Acera M3000 9v, Cassette Shimano HG200 9v 11/34T, Cadena E-BIKE 1/2 X 11/128 S9e, Plato Aluminio 34T, Batería SILION-ROCKETS 504 WH 36V/14 AH integrada",
      "price": 1.540,
      "pictureUrl": "./public/Imagines de Bicis/bicimtb.jpg"
   },
   {
      "id": 2,
      "title": "Specialized Turbo Levo HT 29 2021",
      "categoria": "MTB",
      "descriptionPrimary": "Bicicleta de aluminio Turbo Levo HT, de asistencia eléctrica al pedaleo con motor Specialized 1.2 E.",
      "descriptionSecondary":"Suave, eficiente y silencioso y batería de 400 Wh. Viene equipada con transmisión Shimano de 9 velocidades, frenos de disco hidráulicos y horquilla SR Suntour de 100 mm de recorrido para uso Trail.",
      "price": 2.899,
      "pictureUrl": "./public/Imagines de Bicis/bicimtb2.jpg"
   },
   {
      "id": 3,
      "title": "GT Epantera Dash 29 2020",
      "categoria": "MTB",
      "descriptionPrimary": "La Pantera GT-E presenta un estilo icónico Triple Triangle ™ y la asistencia de Shimano STePS.",
      "descriptionSecondary":"Tiene un cuadro Nuevo ePantera Alloy 29 Frame, Shimano STEPS Specific, batería interna, tubo de dirección cónico, Boost 12x148 eje pasante, Horquilla SR Suntour XCM, 100 mm, desplazamiento de 46 mm ,Cadena: KMC HG71, 8 velocidades, Bielas: Shimano FC-E 5010 165mm,Cambio tras. Shimano Altus, Mandos: Shimano Altus, 8 velocidades, Casete: Shimano HG200, 11-36, 8 velocidades, Ruedas: WTB STX i25 TCSLlantas: WTB Ranger Comp, 29 x 2.25, Shimano, QR y Radios: Acero inoxidable: 14g.",
      "price": 2.499,
      "pictureUrl": "./public/Imagines de Bicis/bicimtb3.jpg"
   },
   {
      "id": 4,
      "title": "Ghost E-Teru Essential 27 2021",
      "categoria": "MTB",
      "descriptionPrimary": "La bicicleta con cuadro de aluminio E-Teru Essential, es de asistencia eléctrica al pedaleo tiene batería Bosch de 500 Wh.",
      "descriptionSecondary":"Además viene equipada con transmisión Shimano de 9 velocidades, frenos hidráulicos Tektro y horquilla Suntour XCM. Pensada para largos recorridos y desplazamientos rápidos, asfalto liso y rutas offroad: La E-Teru es una verdadera all-rounder.",
      "price": 2.399,
      "pictureUrl": "./public/Imagines de Bicis/bicimtb4.jpg"
   },
   {
      "id": 6,
      "title": "Conor Nepal E-Mtb 27,5 2022",
      "categoria": "MTB",
      "descriptionPrimary": "Bicicleta de asistencia eléctrica al pedaleo Nepal E-Mtb 27,5, viene equipada con Motor BAFANG RM 250 y batería dede 504 Wh, para uso Recreativo.",
      "descriptionSecondary":"Tiene un montaje de Horquilla: Suntour XCM RL con bloqueo, recorrido 100mm, Cuadro 27,5 Aluminio 6061, tubería hidroformada ,Batería: SINLION-ROCKETS 504WH 36V/14AH ,Buje delantero: Aluminio MHB20 ,Buje trasero: MOTOR BAFANG RM G020.250.DC ,Cadena: E-BIKE 1/2 X 11/128 S9e ,Cambio: Shimano M310 ,Cargador: SINLION ID-1-PRO 36V|2A ,Cubiertas: Schwalbe Rapid Rob 27,5X2,25 ,Dirección: A-head Integrada 1 1/8",
      "price": 1.550,
      "pictureUrl": "./public/Imagines de Bicis/bicimtb5.jpg"
   },
   {
      "id": 7,
      "title": "Xiaomi Qicycle XL Electric Bike",
      "categoria": "Electrica",
      "descriptionPrimary": "La bicicleta eléctrica Xiaomi QiCycle XL es una bicicleta 100% eléctrica ideal para tus desplazamientos.",
      "descriptionSecondary":"Gracias a su batería de gran capacidad fabricada por LG y su motor de 250w ubicado en la rueda delantera es capaz de asistir al pedaleo hasta velocidades de 25 km/h. Equipa un cambio de 3 velocidades firmado por la prestigiosa Shimano que nos ofrecerá diferentes marchas para poder subir cuestas con mayor facilidad o bajar rampas a mayor velocidad. Ligereza y resistencia son dos de las mayores características del cuadro de la Xiaomi Xicycle, consiguiendo un peso de solo 14,5 kilos. Un peso que la convierte en una de las bicicletas más ligeras del mercado. Las rampas y cuestas de tu ciudad ya no serán un problema en tus desplazamientos, ya que la potencia del motor te asistirá de manera eficiente en la subida.",
      "price": 899,
      "pictureUrl": "./public/Imagines de Bicis/bici-electrica"
   },
   {
      "id": 8,
      "title": "BH Atom Street 2021",
      "categoria": "Electrica",
      "descriptionPrimary": "Bicicleta de aluminio Atom Street de asistencia eléctrica al pedaleo con batería de 500 Wh.",
      "descriptionSecondary":"Transmisión Ashimano de 8 velocidades y horquilla de suspensión para uso Urbano. Tiene un cuadro Street Wave Alloy 26 Internal Cable Routing, horquilla SR Suntour NEX DS 63mm, potencia BH Traditional, Dirección Semi-Integrated 1 1/8 ,manetas cambio Shimano Acera, cambio trasero Shimano Acera 8sp, pedalier: FSA 38T-170mm, cassette Shimano HG31 8sp (11-32T)",
      "price": 2.049,
      "pictureUrl": "./public/Imagines de Bicis/bici-electrica2"
   },
   {
      "id": 9,
      "title": "SixBikes ESB-68 Falcon",
      "categoria": "Electrica",
      "descriptionPrimary": "Bicicleta eléctrica urbana con cuadro de aluminio y ruedas de 700 x 35.",
      "descriptionSecondary":"La geometría minimalista conseguida en su cuadro, la hace muy cómoda, versátil y ágil. La posición en la conducción, es algo agresiva, para que puedas ir más rápido. Con una rueda de 700C y un motor montado en su eje trasero, se ha conseguido poder llegar a una máxima velocidad en menos tiempo. Con un solo piñón nos sirve para movernos por la ciudad de una forma muy ágil. Si te gusta moverte entre los coches, con el máximo control, este es tu modelo. Las luces integradas en el cuadro y controladas desde su pantalla LCD del manillar, la hacen muy visible y fácil de encender en cualquier momento. Su batería desmontable, no solo te proporciona 50 Km a máxima potencia, también te un puerto para cargar tu dispositivo si lo necesitas. Dispones de frenos de disco que te garantizan un máximo control en tus frenadas.",
      "price": 2.300,
      "pictureUrl": "./public/Imagines de Bicis/bici-electrica3"
   },
   {
      "id": 10,
      "title": "SixBikes ESB-65",
      "categoria": "Electrica",
      "descriptionPrimary": "Bicicleta plegable de aluminio SixBikes Esb-65 (20 x 2.35) de asistencia eléctrica al pedaleo, para uso Urbano.",
      "descriptionSecondary":"Aun siendo un diseño más clásico que las Fat, tiene claramente un espíritu deportivo y competidor. Su diseño de batería escondida en la barra del sillín, la hace mucho más moderna y juvenil. Todos sus componentes la hacen lo suficientemente resistente para que se pueda moverse por la ciudad a toda velocidad. Su rueda de 20” 2.35 hace que también se pueda salir de la ciudad para tomar algunos caminos. Su motor de altas prestaciones te permitirá llegar a donde quieras, con una autonomía de hasta 50 Km con toda su potencia. Sus medidas plegada te permite meterla bajo la mesa de trabajo o en el maletero de cualquier coche, por muy pequeño que sea.",
      "price": 1.550,
      "pictureUrl": "./public/Imagines de Bicis/bici-electrica4"
   },
   {
      "id": 11,
      "title": "Littium Ibiza Dogma 10,4A 2021",
      "categoria": "Electrica",
      "descriptionPrimary": "Bicicleta plegable Littium Ibiza Dogma, de asistencia eléctrica al pedaleo con batería de 14A, manejable, ágil, cómoda",
      "descriptionSecondary":"Equipada con los mejores acabados y accesorios para uso Urbano: La Ibiza Dogma es una bicicleta diseñada y desarrollada para moverse por la ciudad como respuesta a la necesidad actual de una movilidad sostenible. Una E-bike plegable de gran versatilidad y potencia que cuenta con las mejores prestaciones del mercado.",
      "price": 1.890,
      "pictureUrl": "./public/Imagines de Bicis/bici-electrica5"
   },
   {
      "id": 12,
      "title": "Bergamont E-Horizon Tour 400 Wave 2021",
      "categoria": "Electrica",
      "descriptionPrimary": "Bicicleta de aluminio E-Horizon Tour 400 Wave, de asistencia eléctrica al pedaleo con batería Bosch de 400 Wh.",
      "descriptionSecondary":"Es una E-Trekking todoterreno con un cuadro Wave recientemente desarrollado en la construcción Monotube Concept, una ergonomía perfecta que tiene características de conducción excepcionales.",
      "price": 2.499,
      "pictureUrl": "./public/Imagines de Bicis/bici-electrica6"
   },
   {
      "id": 13,
      "title": "Ryme Bikes Soho 28",
      "categoria": "Paseo",
      "descriptionPrimary": "Bicicleta de ocio con guardabarros y parrilla incorporados.",
      "descriptionSecondary":"Bicicleta de ocio que gracias a su cambio interno Sturmey Archer de 3 velocidades, perfecto para el ciclismo urbano, te olvidarás de las averías y del mantenimiento. Además tiene cuadro de acero CR-MO altamente resistente.",
      "price": 342,
      "pictureUrl": "./public/Imagines de Bicis/bici-de-paseo"
   },
   {
      "id": 14,
      "title": "Megamo Ronda 28 2021",
      "categoria": "Paseo",
      "descriptionPrimary": "Bicicleta Megamo Ronda con ruedas de 28, cambio Shimano de 6 velocidades y horquilla rígida para uso Urbano.",
      "descriptionSecondary":"Tiene un Cuadro: CITY HI-TEN, Horquilla: HI-TEN UNICROWN, Cambio Trasero: Shimano TZ50 6s, Manetas cambio: Shimano REVOSHIFT RS35 6s, Bielas/Plato: Single SPEED 38x170mm, Piñón: Shimano TZ20 6s, Conjunto de frenos: ALLOY V-BRAKE, Cubiertas: CITY 28 x1.75, Llantas: Alloy, Ruedas: 28",
      "price": 259,
      "pictureUrl": "./public/Imagines de Bicis/bici-de-paseo2"
   },
   {
      "id": 15,
      "title": "Conor Milano 28 2021",
      "categoria": "Paseo",
      "descriptionPrimary": "Bicicleta eléctrica urbana con cuadro de aluminio y ruedas de 700 x 35.",
      "descriptionSecondary":"Tiene un Cuadro: 28 Acero,Horquilla: 28 Horquilla rigida Acero unicrown de alta resistencia ,Manetas: Shimano RS36 ,Frenos: V-Brake alumnio ,Cambio: Shimano Tourney TY300 7v ,Piñón: Shimano TZ500 7v 14/34 ,Plato: Acero negro 38T 170 mm ,Ruedas: 28 ,Cubiertas: Scwalbe 700x38 C Marathon Plus ,Sillín: Selle Royal Romba + kit antirobo sillín ,Tija de sillín: alumnio SP: 200 28,6 mm ,Manillar: Acero 25,4 mm ,Potencia: Acero 25,4 mm ,Talla: 49 ,Dirección:  Acero 1",
      "price": 395,
      "pictureUrl": "./public/Imagines de Bicis/bici-de-paseo3"
   },
   {
      "id": 16,
      "title": "Conor City 24S 2021",
      "categoria": "Paseo",
      "descriptionPrimary": "Bicicleta de aluminio Conor City con cambio Shimano de 3X8 velocidades y frenos V-Brake para uso Urbano.",
      "descriptionSecondary":"Tiene un montaje de: ,Cuadro: 28 Aluminio 6061 ,Horquilla: Suntour SF13 CR-8V ,Manetas: Shimano TX800 ,Frenos: V-Brake aluminio ,Desviador: Shimano TY510 ,Cambio: Shimano TX800 8v ,Piñón: Shimano HG200 8v 12/32T ,Plato: Shimano TY301 170mm 28/38/48T ,Cubiertas: 700X38C Chaoyang ,Sillín: Velo 6050 ,Tija sillín: Aluminio City 27,2mm ,Manillar: City aluminio 25.4mm ,Potencia: Aluminio City Regulable",
      "price": 449,
      "pictureUrl": "./public/Imagines de Bicis/bici-de-paseo4"
   }

]
}
